app/views/profiles/show.html.erb

SELECT "values".* FROM "values"
---
					<% @user_vals.each do |vals| %>
						<div class='value-item'><p><%= vals.value %></p></div>