app/controllers/experiences_controller.rb

  def create
    @experience = Experience.new(experience_params)
    @experience.profile = @profile

    respond_to do |format|
      if @experience.save
---
INSERT INTO "experiences" ("role", "company", "start_date", "end_date", "description", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @experience.update(experience_params)
---
UPDATE "experiences" SET "description" = $1, "updated_at" = $2 WHERE "experiences"."id" = $3  [["description", "did stuff with ruby\r\n\r\nyes i did"], ["updated_at", "2016-01-26 16:49:31.371148"], ["id", 1]]

    def set_experience
      @experience = Experience.find(params[:id])
---
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT 1  [["id", 1]]

    def set_profile
      @profile = Profile.find(params[:profile_id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]