app/controllers/experiences_controller.rb

  def index
    @experiences = Experience.all
---
SELECT "experiences".* FROM "experiences"