app/controllers/profiles_controller.rb

  def index
  	puts "*" * 50
  	puts current_user
    if current_user
      @profile = current_user.profile
    end
    @profiles = Profile.all
---
SELECT "profiles".* FROM "profiles" WHERE (1)

  def mentors
    @profiles = Profile.where(role: 'mentor')
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."role" = $1  [["role", "mentor"]]

  def proteges
    @profiles = Profile.where(role: 'protege')
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."role" = $1  [["role", "protege"]]

  def show
    @experiences = @profile.experiences
    @valuetaggings = @profile.valuetaggings
    @values = Value.all
---
SELECT "values".* FROM "values"

  def create
    @profile = Profile.new(profile_params)
    @profile.user = current_user

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("role", "quote", "insights", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["role", "protege"], ["quote", "wfqwefwqfq"], ["insights", ""], ["user_id", 1], ["created_at", "2016-01-27 16:13:56.152389"], ["updated_at", "2016-01-27 16:13:56.152389"]]

  def update
    UserMailer.welcome_email(current_user).deliver
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "role" = $1, "quote" = $2, "updated_at" = $3 WHERE "profiles"."id" = $4  [["role", "mentor"], ["quote", "I am a mentor, feed me"], ["updated_at", "2016-01-27 00:53:17.221374"], ["id", 10]]