app/controllers/profiles_controller.rb

SELECT "experiences".* FROM "experiences" WHERE "experiences"."profile_id" = $1  [["profile_id", 1]]
---
  def show
    @experiences = @profile.experiences
    @user = current_user
    @user_vals = @profile.values.take(3)